Model: "functional_1"
__________________________________________________________________________________________________
Layer (type)                    Output Shape         Param #     Connected to                     
==================================================================================================
input_1 (InputLayer)            [(None, 64, 64, 1)]  0                                            
__________________________________________________________________________________________________
conv2d (Conv2D)                 (None, 62, 62, 8)    72          input_1[0][0]                    
__________________________________________________________________________________________________
batch_normalization (BatchNorma (None, 62, 62, 8)    32          conv2d[0][0]                     
__________________________________________________________________________________________________
activation (Activation)         (None, 62, 62, 8)    0           batch_normalization[0][0]        
__________________________________________________________________________________________________
conv2d_1 (Conv2D)               (None, 60, 60, 8)    576         activation[0][0]                 
__________________________________________________________________________________________________
batch_normalization_1 (BatchNor (None, 60, 60, 8)    32          conv2d_1[0][0]                   
__________________________________________________________________________________________________
activation_1 (Activation)       (None, 60, 60, 8)    0           batch_normalization_1[0][0]      
__________________________________________________________________________________________________
separable_conv2d (SeparableConv (None, 60, 60, 16)   200         activation_1[0][0]               
__________________________________________________________________________________________________
batch_normalization_3 (BatchNor (None, 60, 60, 16)   64          separable_conv2d[0][0]           
__________________________________________________________________________________________________
activation_2 (Activation)       (None, 60, 60, 16)   0           batch_normalization_3[0][0]      
__________________________________________________________________________________________________
separable_conv2d_1 (SeparableCo (None, 60, 60, 16)   400         activation_2[0][0]               
__________________________________________________________________________________________________
batch_normalization_4 (BatchNor (None, 60, 60, 16)   64          separable_conv2d_1[0][0]         
__________________________________________________________________________________________________
conv2d_2 (Conv2D)               (None, 30, 30, 16)   128         activation_1[0][0]               
__________________________________________________________________________________________________
max_pooling2d (MaxPooling2D)    (None, 30, 30, 16)   0           batch_normalization_4[0][0]      
__________________________________________________________________________________________________
batch_normalization_2 (BatchNor (None, 30, 30, 16)   64          conv2d_2[0][0]                   
__________________________________________________________________________________________________
add (Add)                       (None, 30, 30, 16)   0           max_pooling2d[0][0]              
                                                                 batch_normalization_2[0][0]      
__________________________________________________________________________________________________
separable_conv2d_2 (SeparableCo (None, 30, 30, 32)   656         add[0][0]                        
__________________________________________________________________________________________________
batch_normalization_6 (BatchNor (None, 30, 30, 32)   128         separable_conv2d_2[0][0]         
__________________________________________________________________________________________________
activation_3 (Activation)       (None, 30, 30, 32)   0           batch_normalization_6[0][0]      
__________________________________________________________________________________________________
separable_conv2d_3 (SeparableCo (None, 30, 30, 32)   1312        activation_3[0][0]               
__________________________________________________________________________________________________
batch_normalization_7 (BatchNor (None, 30, 30, 32)   128         separable_conv2d_3[0][0]         
__________________________________________________________________________________________________
conv2d_3 (Conv2D)               (None, 15, 15, 32)   512         add[0][0]                        
__________________________________________________________________________________________________
max_pooling2d_1 (MaxPooling2D)  (None, 15, 15, 32)   0           batch_normalization_7[0][0]      
__________________________________________________________________________________________________
batch_normalization_5 (BatchNor (None, 15, 15, 32)   128         conv2d_3[0][0]                   
__________________________________________________________________________________________________
add_1 (Add)                     (None, 15, 15, 32)   0           max_pooling2d_1[0][0]            
                                                                 batch_normalization_5[0][0]      
__________________________________________________________________________________________________
separable_conv2d_4 (SeparableCo (None, 15, 15, 64)   2336        add_1[0][0]                      
__________________________________________________________________________________________________
batch_normalization_9 (BatchNor (None, 15, 15, 64)   256         separable_conv2d_4[0][0]         
__________________________________________________________________________________________________
activation_4 (Activation)       (None, 15, 15, 64)   0           batch_normalization_9[0][0]      
__________________________________________________________________________________________________
separable_conv2d_5 (SeparableCo (None, 15, 15, 64)   4672        activation_4[0][0]               
__________________________________________________________________________________________________
batch_normalization_10 (BatchNo (None, 15, 15, 64)   256         separable_conv2d_5[0][0]         
__________________________________________________________________________________________________
conv2d_4 (Conv2D)               (None, 8, 8, 64)     2048        add_1[0][0]                      
__________________________________________________________________________________________________
max_pooling2d_2 (MaxPooling2D)  (None, 8, 8, 64)     0           batch_normalization_10[0][0]     
__________________________________________________________________________________________________
batch_normalization_8 (BatchNor (None, 8, 8, 64)     256         conv2d_4[0][0]                   
__________________________________________________________________________________________________
add_2 (Add)                     (None, 8, 8, 64)     0           max_pooling2d_2[0][0]            
                                                                 batch_normalization_8[0][0]      
__________________________________________________________________________________________________
separable_conv2d_6 (SeparableCo (None, 8, 8, 128)    8768        add_2[0][0]                      
__________________________________________________________________________________________________
batch_normalization_12 (BatchNo (None, 8, 8, 128)    512         separable_conv2d_6[0][0]         
__________________________________________________________________________________________________
activation_5 (Activation)       (None, 8, 8, 128)    0           batch_normalization_12[0][0]     
__________________________________________________________________________________________________
separable_conv2d_7 (SeparableCo (None, 8, 8, 128)    17536       activation_5[0][0]               
__________________________________________________________________________________________________
batch_normalization_13 (BatchNo (None, 8, 8, 128)    512         separable_conv2d_7[0][0]         
__________________________________________________________________________________________________
conv2d_5 (Conv2D)               (None, 4, 4, 128)    8192        add_2[0][0]                      
__________________________________________________________________________________________________
max_pooling2d_3 (MaxPooling2D)  (None, 4, 4, 128)    0           batch_normalization_13[0][0]     
__________________________________________________________________________________________________
batch_normalization_11 (BatchNo (None, 4, 4, 128)    512         conv2d_5[0][0]                   
__________________________________________________________________________________________________
add_3 (Add)                     (None, 4, 4, 128)    0           max_pooling2d_3[0][0]            
                                                                 batch_normalization_11[0][0]     
__________________________________________________________________________________________________
conv2d_6 (Conv2D)               (None, 4, 4, 7)      8071        add_3[0][0]                      
__________________________________________________________________________________________________
global_average_pooling2d (Globa (None, 7)            0           conv2d_6[0][0]                   
__________________________________________________________________________________________________
predictions (Activation)        (None, 7)            0           global_average_pooling2d[0][0]   
==================================================================================================
Total params: 58,423
Trainable params: 56,951
Non-trainable params: 1,472
__________________________________________________________________________________________________
